# Pandas "loc()" & "iloc()" method : Access a group of rows and columns by lebel(s) or a Boolean array.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("test.csv")
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72,74
1,female,group C,some college,standard,completed,69.0,90,88
2,female,group B,master's degree,standard,none,NaN,95,93
3,male,group A,associate's degree,free/reduced,none,NaN,57,44
4,male,group C,some college,standard,none,NaN,78,75
5,female,group B,associate's degree,standard,none,NaN,83,78
6,female,group B,some college,standard,completed,88.0,95,92
7,male,group B,some college,free/reduced,none,40.0,43,39
8,male,group D,high school,free/reduced,completed,64.0,64,67

# Pandas loc method : Location based indexing

#### Syntax ====>>> DataFrame.loc[  ]

In [11]:
#Passing a single value to loc() method : 

df.loc[0]

gender                                    female
race/ethnicity                           group B
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                     none
math score                                    72
reading score                                 72
writing score                                 74
Name: 0, dtype: object

In [22]:
#Use [[index]] for tabular type :

df.loc[[0]]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72,74

In [7]:
df.loc[7]

gender                                 male
race/ethnicity                      group B
parental level of education    some college
lunch                          free/reduced
test preparation course                none
math score                               40
reading score                            43
writing score                            39
Name: 7, dtype: object

In [12]:
#Passing a list as value to loc() method to print multiple rows :

df.loc[[1,4,7]]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,female,group C,some college,standard,completed,69.0,90,88
4,male,group C,some college,standard,none,NaN,78,75
7,male,group B,some college,free/reduced,none,40.0,43,39

In [14]:
# df.loc[row,[column1,column2,......]] we are printing specific row and their specific column :

df.loc[4,["math score","reading score"]]

math score       NaN
reading score     78
Name: 4, dtype: object

In [16]:
#Slicing of values according to specific row and its column :

df.loc[1:4,"gender"]

1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [17]:
# Using Conditional Operator :

df.loc[df["reading score"] > 78]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,female,group C,some college,standard,completed,69.0,90,88
2,female,group B,master's degree,standard,none,NaN,95,93
5,female,group B,associate's degree,standard,none,NaN,83,78
6,female,group B,some college,standard,completed,88.0,95,92

In [18]:
# Printing specific column based on conditional operator :

df.loc[df["reading score"] > 78, ["parental level of education"]]

  parental level of education
1                some college
2             master's degree
5          associate's degree
6                some college

# Pandas iloc[] method : Integer location based indexing
#### Syntax ===>>> DataFrame.iloc[ ]

In [19]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72,74
1,female,group C,some college,standard,completed,69.0,90,88
2,female,group B,master's degree,standard,none,NaN,95,93
3,male,group A,associate's degree,free/reduced,none,NaN,57,44
4,male,group C,some college,standard,none,NaN,78,75
5,female,group B,associate's degree,standard,none,NaN,83,78
6,female,group B,some college,standard,completed,88.0,95,92
7,male,group B,some college,free/reduced,none,40.0,43,39
8,male,group D,high school,free/reduced,completed,64.0,64,67

In [24]:
#Non tabular Form :

df.iloc[0]

gender                                    female
race/ethnicity                           group B
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                     none
math score                                    72
reading score                                 72
writing score                                 74
Name: 0, dtype: object

In [25]:
# Tabular Form

df.iloc[[0]]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72.0,72,74

In [32]:
#df.iloc[row,column]...... For all row we use " : "

df.iloc[:,0]

0    female
1    female
2    female
3      male
4      male
5    female
6    female
7      male
8      male
Name: gender, dtype: object

In [33]:
#Printing 4'th row and O'th column :

df.iloc[4,0]

'male'

In [31]:
df.iloc[4,:]

gender                                 male
race/ethnicity                      group C
parental level of education    some college
lunch                              standard
test preparation course                none
math score                              NaN
reading score                            78
writing score                            75
Name: 4, dtype: object